{
    "id": "2004_detectscanning",
    "name": "Feasibility of Detecting TCP-SYN Scanning at a Backbone router",
    "datePublished": "2004.06",
    "description": "IP address and TCP/UDP port scanning are\r\ncritical components of many network attacks. Such scanning\r\nallows attackers to spread a self-propagating worm or collect\r\ndetailed information about end-hosts in preparation for attacks.\r\nThis paper investigates an algorithm to detect TCP-SYN\r\nscanning. Special care is taken to detect even stealthy scanners.\r\nAttackers are detected by tracking the number of half-open\r\nconnections generated by each source. However, a source is\r\nonly tracked until it is clear that it is not currently scanning.\r\nThe computational load of this method is analyzed and it is\r\nfound that the method is not computationally intensive and\r\nis suitable for online detection of scanning even on backbone\r\nlinks. Specifically, on a backbone link investigated it was found\r\nthat the total number of sources that needs to be tracked at\r\nany one time is at most a few thousand.\r\n",
    "annotation": "",
    "tags": [
        "security"
    ],
    "pubdb_id": "paper76",
    "authors": [
        {
            "person": "person:Shah__Khushboo",
            "organizations": [
                "Department of Electrical Engineering, University of Southern California"
            ]
        },
        {
            "person": "person:Bohacek__Stephan",
            "organizations": [
                "University of Delaware"
            ]
        },
        {
            "person": "person:Broido__Andre",
            "organizations": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        }
    ],
    "links": [],
    "institution": "",
    "journal": "",
    "volume": "",
    "number": "",
    "linkedObjects": "",
    "__typename": "paper",
    "filename": "sources/paper/2004_detectscanning__pubdb.json",
    "publisher": "IEEE American Control Conference",
    "resources": [
        {
            "name": "PDF",
            "url": "https://www.caida.org/publications/papers/2004/detectscanning/detectscanning.pdf",
            "tags": []
        }
    ],
    "bibtexFields": {
        "type": "INPROCEEDINGS",
        "bookTitle": "IEEE American Control Conference",
        "pages": "988-995"
    },
    "date": "2004.06"
}