{
    "id": "2008_classification_demystified",
    "name": "Internet Traffic Classification Demystified: Myths, Caveats, and the Best Practices",
    "datePublished": "2008.12",
    "description": "Recent research on Internet traffic classification algorithms has yielded a flurry of proposed approaches for distinguishing types of traffic, but no systematic comparison of the various algorithms. This fragmented approach to traffic classification research leaves the operational community with no basis for consensus on what approach to use when, and how to interpret results. In this work we critically revisit traffic classification by conducting a thorough evaluation of three classification approaches, based on transport layer ports, host behavior, and flow features. A strength of our work is the broad range of data against which we test the three classification approaches: seven traces with payload collected in Japan, Korea, and the US. The diverse geographic locations, link characteristics and application traffic mix in these data allowed us to evaluate the approaches under a wide variety of conditions. We analyze the advantages and limitations of each approach, evaluate methods to overcome the limitations, and extract insights and recommendations for both the study and practical application of traffic classification. We make our software, classifiers, and data available for researchers interested in validating or extending this work.\r\n\r\n",
    "annotation": "",
    "tags": [
        "measurement methodology",
        "passive data analysis"
    ],
    "pubdb_id": "paper22",
    "authors": [
        {
            "person": "person:Kim__Hyunchul",
            "organizations": [
                "Seoul National University, Korea"
            ]
        },
        {
            "person": "person:claffy__kc",
            "organizations": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:Fomenkov__Marina",
            "organizations": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:Barman__Dhiman",
            "organizations": [
                "University of California, Riverside (UCR)"
            ]
        },
        {
            "person": "person:Faloutsos__Michalis",
            "organizations": [
                "University of California, Riverside (UCR)"
            ]
        },
        {
            "person": "person:Lee__KiYoung",
            "organizations": [
                "University of California, San Diego (UCSD)"
            ]
        }
    ],
    "links": [],
    "journal": "",
    "volume": "",
    "number": "",
    "pages": "",
    "linkedObjects": "",
    "__typename": "paper",
    "filename": "sources/paper/2008_classification_demystified__pubdb.json",
    "publisher": "ACM SIGCOMM Conference on emerging Networking EXperiments and Technologies (CoNEXT)",
    "resources": [
        {
            "name": "Data Supplement",
            "url": "http://mmlab.snu.ac.kr/~hkim/code-data-access.html",
            "tags": []
        },
        {
            "name": "PDF",
            "url": "https://www.caida.org/publications/papers/2008/classification_demystified/classification_demystified.pdf",
            "tags": []
        }
    ],
    "bibtexFields": {
        "type": "INPROCEEDINGS",
        "bookTitle": "ACM SIGCOMM Conference on emerging Networking EXperiments and Technologies (CoNEXT)",
        "institution": "Cooperative Association for Internet Data Analysis (CAIDA)"
    },
    "date": "2008.12"
}