{
    "id": "2019_bgp_hijacking_classification",
    "name": "BGP Hijacking Classification",
    "datePublished": "2019.06",
    "description": "Recent reports show that BGP hijacking has increased substantially. BGP hijacking allows malicious ASes to obtain IP prefixes for spamming as well as intercepting or blackholing traffic. While systems to prevent hijacks are hard to deploy and require the cooperation of many other organizations, techniques to detect hijacks have been a popular area of study. In this paper, we classify detected hijack events in order to document BGP detectors output and understand the nature of reported events. We introduce four categories of BGP hijack: typos, prepending mistakes, origin changes, and forged AS paths. We leverage AS hegemony – a measure of dependency in AS relationship – to identify forged AS paths in a fast and efficient way. Besides, we utilize heuristic approaches to find common operators’ mistakes such as typos and AS prepending mistakes. The proposed approach classifies our collected ground truth into four categories with 95.71% accuracy. We characterize publicly reported alarms (e.g. BGPMon) with our trained classifier and find 4%, 1%, and 2% of typos, prepend mistakes, and BGP hijacking with a forged AS path, respectively.",
    "annotation": "",
    "tags": [
        "routing",
        "security",
        "topology"
    ],
    "pubdb_id": "paper677",
    "authors": [
        {
            "person": "person:Cho__Shinyoung",
            "organizations": [
                "Stony Brook University"
            ]
        },
        {
            "person": "person:Fontugne__Romain",
            "organizations": [
                "IIJ Research Lab"
            ]
        },
        {
            "person": "person:Cho__Kenjiro",
            "organizations": [
                "IIJ Research Lab"
            ]
        },
        {
            "person": "person:Dainotti__Alberto",
            "organizations": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:Gill__Phillipa",
            "organizations": [
                "UMass Amherst"
            ]
        }
    ],
    "links": [],
    "institution": "",
    "journal": "",
    "volume": "",
    "number": "",
    "pages": "",
    "linkedObjects": "",
    "__typename": "paper",
    "filename": "sources/paper/2019_bgp_hijacking_classification__pubdb.json",
    "publisher": "Network Traffic Measurement and Analysis Conference (TMA)",
    "resources": [
        {
            "name": "DOI",
            "url": "https://doi.org/10.23919/TMA.2019.8784511",
            "tags": []
        },
        {
            "name": "PDF",
            "url": "https://www.caida.org/publications/papers/2019/bgp_hijacking_classification/bgp_hijacking_classification.pdf",
            "tags": []
        }
    ],
    "bibtexFields": {
        "type": "INPROCEEDINGS",
        "bookTitle": "Network Traffic Measurement and Analysis Conference (TMA)"
    },
    "date": "2019.06"
}