{
    "id": "2020_unintended_consequences",
    "name": "Unintended consequences: Effects of submarine cable deployment on Internet routing",
    "datePublished": "2020.03",
    "description": "We use traceroute and BGP data from globally distributed Internet measurement infrastructures to study the impact of a noteworthy submarine cable launch connecting Africa to South America. We leverage archived data from RIPE Atlas and CAIDA Ark platforms, as well as custom measurements from strategic vantage points, to quantify the differences in end-to-end latency and path lengths before and after deployment of this new South-Atlantic cable. We find that ASes operating in South America significantly benefit from this new cable, with reduced latency to all measured African countries. More surprising is that end-to-end latency to/from some regions of the world, including intra-African paths towards Angola, increased after switching to the cable. We track these unintended consequences to suboptimally circuitous IP paths that traveled from Africa to Europe, possibly North America, and South America before traveling back to Africa over the cable. Although some suboptimalities are expected given the lack of peering among neighboring ASes in the developing world, we found two other causes: (i) problematic intra-domain routing within a single Angolese network, and (ii) suboptimal routing/traffic engineering by its BGP neighbors. After notifying the operating AS of our results, we found that most of these suboptimalities were subsequently resolved. We designed our method to generalize to the study of other cable deployments or outages and share our code to promote reproducibility and extension of our work",
    "annotation": "This paper was awarded Best Paper at PAM 2020.",
    "tags": [
        "topology",
        "routing",
        "measurement methodology"
    ],
    "pubdb_id": "paper697",
    "authors": [
        {
            "person": "person:Fanou__Rodérick",
            "organizations": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:Huffaker__Bradley",
            "organizations": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:Mok__Ricky K. P.",
            "organizations": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        },
        {
            "person": "person:claffy__kc",
            "organizations": [
                "CAIDA, San Diego Supercomputer Center, University of California San Diego"
            ]
        }
    ],
    "links": [
        {
            "to": "media:2020_unintended_consequences_pam",
            "url": "https://www.caida.org/publications/presentations/2020/unintended_consequences_pam/"
        }
    ],
    "institution": "",
    "journal": "",
    "volume": "",
    "number": "",
    "pages": "",
    "linkedObjects": "",
    "__typename": "paper",
    "filename": "sources/paper/2020_unintended_consequences__pubdb.json",
    "publisher": "Passive and Active Measurement Conference (PAM)",
    "resources": [
        {
            "name": "PDF",
            "url": "https://www.caida.org/publications/papers/2020/unintended_consequences/unintended_consequences.pdf",
            "tags": []
        },
        {
            "name": "Related Video",
            "url": "https://www.youtube.com/watch?v=g9-fQKlDOaM",
            "tags": []
        }
    ],
    "bibtexFields": {
        "type": "INPROCEEDINGS",
        "bookTitle": "Passive and Active Measurement Conference (PAM)"
    },
    "date": "2020.03"
}